# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArray..::..Item Property
ElementArray Class See Also
---
Gets or sets an element at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Element this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As Element
	Get
	Set
```

Visual C++
---
```text
public:
virtual property Element^ Item[int index] {
	Element^ get (int index);
	void set (int index, Element^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the element to be set or retrieved.
# ### Return Value
Returns the element at the specified index.
# See Also
ElementArray Class
Autodesk.Revit.DB Namespace